In [1]:
# Load and activate the SQL extension to allow us to execute SQL in a Jupyter notebook. 

%load_ext sql

In [2]:
# Establish a connection to the local database using the '%sql' magic command
%sql mysql+pymysql://root:ek.05w4242@localhost:3306/md_water_services

#### Cleaning the data 
Update the employee table email column with an appropriate email address. 
1. The email  should be in the format: first_name.last_name@ndogowater.gov
2. The

In [3]:
%%sql 
# show the emplyee table 

SELECT 
    *
FROM
    employee
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[(0, 'Amara Jengo', '+99637993287 ', None, '36 Pwani Mchangani Road', 'Sokoto', 'Ilanga', 'Field Surveyor'),
 (1, 'Bello Azibo', '+99643864786 ', None, '129 Ziwa La Kioo Road', 'Kilimani', 'Rural', 'Field Surveyor'),
 (2, 'Bakari Iniko', '+99222599041 ', None, '18 Mlima Tazama Avenue', 'Hawassa', 'Rural', 'Field Surveyor'),
 (3, 'Malachi Mavuso', '+99945849900 ', None, '100 Mogadishu Road', 'Akatsi', 'Lusaka', 'Field Surveyor'),
 (4, 'Cheche Buhle', '+99381679640 ', None, '1 Savanna Street', 'Akatsi', 'Rural', 'Field Surveyor')]

In [7]:
%%sql 
# Replace the space in the employee name with full stop

SELECT 
    REPLACE(employee_name, ' ', '.') AS new_employee_name
FROM 
    employee
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('Amara.Jengo',),
 ('Bello.Azibo',),
 ('Bakari.Iniko',),
 ('Malachi.Mavuso',),
 ('Cheche.Buhle',)]

In [8]:
%%sql 
# Make all the names lower 

SELECT 
    LOWER(REPLACE(employee_name, ' ', '.')) AS new_employee_name_lower
FROM 
    employee
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('amara.jengo',),
 ('bello.azibo',),
 ('bakari.iniko',),
 ('malachi.mavuso',),
 ('cheche.buhle',)]

In [10]:
%%sql 
# Use CONACT to add the rest of the email address

SELECT 
    CONCAT(
    LOWER(REPLACE(employee_name, ' ', '.')), '@ndogowater.gov') AS new_email
FROM 
    employee
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('amara.jengo@ndogowater.gov',),
 ('bello.azibo@ndogowater.gov',),
 ('bakari.iniko@ndogowater.gov',),
 ('malachi.mavuso@ndogowater.gov',),
 ('cheche.buhle@ndogowater.gov',)]

In [11]:
%%sql 
# Update the email column with the email address

UPDATE employee
SET email = CONCAT(
    LOWER(REPLACE(employee_name, ' ', '.')), '@ndogowater.gov')

 * mysql+pymysql://root:***@localhost:3306/md_water_services
56 rows affected.

[]

In [12]:
%%sql 
# Show the employee table 

SELECT 
    *
FROM
    employee
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[(0, 'Amara Jengo', '+99637993287 ', 'amara.jengo@ndogowater.gov', '36 Pwani Mchangani Road', 'Sokoto', 'Ilanga', 'Field Surveyor'),
 (1, 'Bello Azibo', '+99643864786 ', 'bello.azibo@ndogowater.gov', '129 Ziwa La Kioo Road', 'Kilimani', 'Rural', 'Field Surveyor'),
 (2, 'Bakari Iniko', '+99222599041 ', 'bakari.iniko@ndogowater.gov', '18 Mlima Tazama Avenue', 'Hawassa', 'Rural', 'Field Surveyor'),
 (3, 'Malachi Mavuso', '+99945849900 ', 'malachi.mavuso@ndogowater.gov', '100 Mogadishu Road', 'Akatsi', 'Lusaka', 'Field Surveyor'),
 (4, 'Cheche Buhle', '+99381679640 ', 'cheche.buhle@ndogowater.gov', '1 Savanna Street', 'Akatsi', 'Rural', 'Field Surveyor')]

In [14]:
%%sql 
# Check the length of the Phone numbers 

SELECT 
    LENGTH(phone_number) AS length_phone_number
FROM 
    employee
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[(13,), (13,), (13,), (13,), (13,)]

In [16]:
%%sql 
# Removes leading and trailing spaces on the phone_number column a

SELECT 
    TRIM(phone_number) AS trimmed_phone_number
FROM
    employee
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('+99637993287',),
 ('+99643864786',),
 ('+99222599041',),
 ('+99945849900',),
 ('+99381679640',)]

In [17]:
%%sql 
# Updates the employee table with the trimmed phone_number column 

UPDATE employee
SET phone_number = TRIM(phone_number)

 * mysql+pymysql://root:***@localhost:3306/md_water_services
56 rows affected.

[]